{"Blog":{"slug":"Blog","filePath":"Blog.md","title":"Blog","links":["Projects/Statecraft","Projects/The-Worlds-Most-Powerful-Minecraft-Computer","Projects/50-more-Terabytes"],"tags":[],"content":"I am always working on something! This is where I discuss the things that I am working on.\n\nStatecraft\nA Minecraft mod that combines the skills of Creativity, Diplomacy, and Logistics into a unified gameplay experience.\n\nThe Worlds Most Powerful Minecraft Computer\nHave you ever wanted to get more ram for your Minecraft server? Well I figured out the limits of what modern day (HPC) high perforce computing can offer the game!\n\nAdding 50 more Terabytes to my NAS\nOver the Summer I bought more hard drives for the NAS.\n"},"Index":{"slug":"Index","filePath":"Index.md","title":"Index","links":["Blog","Resume"],"tags":[],"content":"Welcome\nHello, my name is Jacob and I am a Senior @ Purdue University studying cybersecurity and love all things technology. I love learning something new everyday. In my spare time, I work on applying the concepts I have learned in class to my homelab.\n\n\nCurrent Projects\nI am always working on something!\nFind out more: Blog\n\nResume\nPLEASE HIRE ME 😭\nResume\n\nContact Me\nResume: Resume\nLinkedIn: LinkedIn\nEmail: Jacob@Hexadual.io\nGitHub: Hexadual"},"Projects/50-more-Terabytes":{"slug":"Projects/50-more-Terabytes","filePath":"Projects/50 more Terabytes.md","title":"50 more Terabytes","links":[],"tags":[],"content":"8/23/2024\nOver the Summer I managed to buy 10 more hard drives (WD Red Plus’s). Each one was 10TB and was going to be installed into my NAS. This was a much needed upgrade as I was completely out of storage\n\nPart 1: The RAID\nIn the middle pod I added 5 more hard drives, each one was 10 Terabytes for a total raw addition of 50 terabytes. However, due to redundancy this is not how much space I was able to get back. In that pod of 5 I configured the system to allow for 1 drive to fail and still retail all the data that is stored across the 5 drives. So the total usable space is 40 Terabytes of usable space. This is all possible due to a cool technology called a RAID (Redundant Array of Independent Disks.) and an operating system called TrueNAS.\n\nThe New five hard drives installed in the middle pod of the NAS Chassis\n\nPart 2: Airflow\nThe fun was not over that easily! After finishing everything that needed to be done I cleaned up the server and put it back on the rack and all was well. Until about 30 minuets later when I realized that the new RAID performance was extremely worse than what was expected. After digging around I saw that the new drives that were installed were running at 65 degrees (149F). For reference the recommended temperature of a hard drive is 5 to 50 degrees. After googling that fact I realized that I forgot to install the fan in the front of the new hard drives. There was no fan that was blowing fresh air over the drives to cool them. Which is why they were 15 degrees over temprature. After I installed the fan the temps were able to drop all the way down to 45 degrees (113F)\n\nFigure 2: Hard Drive temps before and after the cooling fan\nSo morale of the story to always install fans in a server.\n"},"Projects/Statecraft":{"slug":"Projects/Statecraft","filePath":"Projects/Statecraft.md","title":"Statecraft","links":[],"tags":[],"content":"4/22/2025\nStatecraft is the project that me and my friends have been working on for the past year.\n\nPart 1: The Concept\nStatecraft is a Minecraft project that is attempting to recreate MCHeli.A mod that adds a lot of war like vehicles to the game like tanks, and fighter jets in modern Minecraft (1.19.2) . The project will also add aspects of politics like borders, trading, spying, and all sorts of other diplomatic activities that teams can engage in with other teams.\n\nPart 1: The World\nThe plan for statecraft is a simple one at first glance. But gets oh so much harder upon implementation. The plan for the the server that\n"},"Projects/The-Worlds-Most-Powerful-Minecraft-Computer":{"slug":"Projects/The-Worlds-Most-Powerful-Minecraft-Computer","filePath":"Projects/The Worlds Most Powerful Minecraft Computer.md","title":"The Worlds Most Powerful Minecraft Computer","links":[],"tags":[],"content":"4/26/2025"},"Resume":{"slug":"Resume","filePath":"Resume.md","title":"Resume","links":[],"tags":[],"content":"\n\n\n                  \n                  PLEASE!!! \n                  \n                \n\n\nHIRE ME! HIRE ME! HIRE ME! HIRE ME! HIRE ME! HIRE ME! HIRE ME! HIRE ME!\n\n\n"}}