{"Blog-Posts/50-more-Terabytes":{"slug":"Blog-Posts/50-more-Terabytes","filePath":"Blog Posts/50 more Terabytes.md","title":"50 more Terabytes","links":[],"tags":[],"content":"4/23/2025\nTLDR: Over the Summer I managed to buy 10 more hard drives (WD Red Plus’s). Each one was 10TB and was going to be installed into my NAS. This was a much needed upgrade as I was completely out of storage\n\nPart 1: The RAID\nIn the middle pod I added 5 more hard drives, each one was 10 Terabytes for a total raw addition of 50 terabytes. However, due to redundancy this is not how much space I was able to get back. In that pod of 5 I configured the system to allow for 1 drive to fail and still retail all the data that is stored across the 5 drives. So the total usable space is 40 Terabytes of usable space. This is all possible due to a cool technology called a RAID (Redundant Array of Independent Disks.) and an operating system called TrueNAS.\n\nFigure 1: The New five hard drives installed in the middle pod of the NAS Chassis\n\nPart 2: Airflow\nThe fun was not over that easily! After finishing everything that needed to be done I cleaned up the server and put it back on the rack and all was well. Until about 30 minuets later when I realized that the new RAID performance was extremely worse than what was expected. After digging around I saw that the new drives that were installed were running at 65 degrees (149F). For reference the recommended temperature of a hard drive is 5 to 50 degrees. After googling that fact I realized that I forgot to install the fan in the front of the new hard drives. There was no fan that was blowing fresh air over the drives to cool them. Which is why they were 15 degrees over temperature. After I installed the fan the temps were able to drop all the way down to 45 degrees (113F)\n\nFigure 2: Hard Drive temps before and after the cooling fan\nSo morale of the story to always install fans in a server."},"Blog-Posts/Accessing-all-my-files-from-every-device":{"slug":"Blog-Posts/Accessing-all-my-files-from-every-device","filePath":"Blog Posts/Accessing all my files from every device.md","title":"Accessing all my files from every device","links":[],"tags":[],"content":"6/19/2025\nTLDR: I used Synching to backup and sync all my files across 3 states and 4 devices.\n\nWHY?\nIn the modern world everyone relies on things like Google Drive, Microsoft OneDrive and to a lesser extent iCloud to be able to access files when they need them. For me I didn’t like the idea of using something like OneDrive to store all of the documents that I was working on for school. I wanted to be able to access my projects even when I was offline. Because of this I needed to have the files on my computer. However this posed a new question. If I were to start something on my laptop and then come home from class I would need to transfer it to my desktop to keep working on it. I need something to Sync the files between my devices. Upon first thought the solution is to simply install Syncthing on my laptop and desktop then boom problem solved. Well not exactly.  for Syncthing to work both devices need to be awake to talk to each other. This means that I still need to get my laptop out when I get home and then let it connect to my PC and then once its done I can put it away. So I needed to get more creative.\n\nHOW?\nThe solution that I came up with is to have a server running Syncthing that is always accessible on a VM in my homelab. Then on all of the devices that need to access my files they connect to the server and constantly synchronize what I am working on to the server. When one of my devices comes online it gets the latest changes and new files. This allows me to work on something in class on my laptop in the morning. Then when I get home form class my work is already in the Syncthing server. So when I turn on my PC it automatically gets the work from the server. I don’t even need to take my laptop out of my backpack. \nImage 1: My Syncthing implantation diagram.\n\nOther cool configurations\nPicking what Files get synced\nMy laptop only has 500GB of storage so I don’t want all the files that are on my desktop to get sent to my laptop. So what I did was configure Syncthing so that only my school folder and my pictures folder got synced to my laptop. On my gaming computer It only synced my video’s folder for game recordings and pictures for screenshots.\n\nImage 2: My PCs Syncthing panel\n321 BACKUP\nOne fun extra perk of using a central Syncthing server is it also acts as a central point for a backup server. For my implementation I followed the 321 backup method.\n\n\n                  \n                  Quote\n                  \n                \n\n\n\nThree Copies: This includes your original data and two separate backup copies.\nTwo Different Media: This means storing your backups on different types of storage, such as a hard drive and cloud storage, or a server and an external drive.\nOne Off-site Copy: This ensures that one backup is stored in a physically separate location from your primary data and other backups, protecting against site-specific disasters like fires or floods\n\n\n\n\nThree Copies: I have three copies of my data. One on my PC, one on the Syncthing server, and the third is on the offsite backup server that my Syncthing server backs up to.\nTwo Different Media: For two different media, all of the storage for the Syncthing and the off site backup servers are in a RAID5 configuration as well as on different systems.\nOne Off-site Copy: My Syncthing server stores all of its data on a NAS that is in my homelab. Every night that NAS backs up a copy of itself to another NAS that I have at a different location.\n\nSyncthing has become such a seamless part of my daily life that I often forget it’s even there. Quietly running in the background, it keeps my files synced across my devices without me even thinking about it."},"Blog-Posts/Covid-Epoch-Time":{"slug":"Blog-Posts/Covid-Epoch-Time","filePath":"Blog Posts/Covid Epoch Time.md","title":"Covid Epoch Time","links":[],"tags":[],"content":"6/24/2025\nTDLR: I made a website that tracks the seconds since the day school shut down for COVID-19 in Illinois.\n\nMy friends and I recently realized we’ve been keeping track of the time in our lives by how long its been since the COVID-19 school shutdowns in 2020. That instantly brought the UNIX epoch timestamp to mind, so an hour later, the COVID Epoch Timestamp was born.\n\nTime.Hexadual.io\n"},"Blog":{"slug":"Blog","filePath":"Blog.md","title":"Blog","links":["Blog-Posts/Covid-Epoch-Time","Blog-Posts/Accessing-all-my-files-from-every-device","Blog-Posts/50-more-Terabytes"],"tags":[],"content":"I am always working on something! Whether that be school, or one of my many personal projects.\n\nCovid Epoch Time\nTrack the passage of time since the start of the COVID-19 pandemic\n\nAccessing all my files from every device\nI made a solution that allows me to access all my files anywhere without using the cloud.\n\nAdding 50 more Terabytes to my NAS\nOver the Summer I bought more hard drives for the NAS."},"Resume":{"slug":"Resume","filePath":"Resume.md","title":"Resume","links":[],"tags":[],"content":"\n\n\n                  \n                  Info\n                  \n                \n\n\nResume last updated 6/24/25\n\n\n"},"Services":{"slug":"Services","filePath":"Services.md","title":"Services","links":[],"tags":[],"content":"File Share\nQuickly send and embed small files\n\nYouTube Archive\nYouTube Video Archive\n\nSlop Toob\nLive TV but its all slop\n\nFile Drive\nBackup storage for files\n\nLive Stream\nThe stream may break but the fun is guaranteed!!\n\nCOVID Epoch Time\nSeconds since March 13, 2020\n\nFood Database\nFind out what I’m cooing\n\nStatus Page\n\n*Updates in real time*"},"index":{"slug":"index","filePath":"index.md","title":"index","links":["Blog","Resume","Services"],"tags":[],"content":"Welcome\nHi, I’m Jacob — a recent Purdue University graduate with a degree in Cybersecurity.\nI’m passionate about technology, lifelong learning, and applying what I learn to real-world projects in my homelab. This site is where I share my thoughts, experiments, and experience—both academic and hands-on.\n\n\nCurrent Projects\nI am always working on something!\nFind out more: Blog\n\nMy Resume\nCurious about my background, skills, or experience?\nCheck out my Resume.\n\nContact Me\nLinkedIn\nEmail: Jacob@Hexadual.io\nGitHub: Hexadual\n\nCheck out my services\nServices\nStatus Page"}}