{"Blog":{"slug":"Blog","filePath":"Blog.md","title":"Blog","links":["Projects/Photojournalism-Article","Projects/Stakeholders-Sheet","Projects/Counter-messaging-Campaign","Projects/Min-Podcast","Projects/What-we-can-learn-from-conspiracy-theories","Projects/50-more-Terabytes","Projects/Statecraft","Projects/The-Worlds-Most-Powerful-Minecraft-Computer"],"tags":[],"content":"I am always working on something! Whether that be school, or one of my many personal projects.\n\nProject 1: Photojournalism Article\nFor this assignment I wrote an article that discusses the future of Purdue through the view of the construction that is affecting campus.\nSupporting Work: Stakeholders Sheet\nFor this assignment we needed to create a sheet that analyzes the basics for our Photojournalism Article. Such as the target audience, Purpose, exigence, and genre.\n\nProject 2: Counter-messaging Campaign\nFor this assignment I created a lecture that discusses misinformation through the lenses of the moon landing. I discussed things like how misinformation spreads and what we can do to stop it.\nSupporting Work: Min Podcast\nThis was a 5 minuet podcast that discusses, explains and counters the moon landing conspiracy.\nReading Response 2: What we can learn from conspiracy theories\nThis is a reading response for the works that we read in preparation for the Counter-messaging Campaign assignment.\n\nAdding 50 more Terabytes to my NAS\nOver the Summer I bought more hard drives for the NAS.\n\nStatecraft\nA Minecraft mod that combines the skills of Creativity, Diplomacy, and Logistics into a unified gameplay experience.\n\nThe Worlds Most Powerful Minecraft Computer\nHave you ever wanted to get more ram for your Minecraft server? Well I figured out the limits of what modern day (HPC) high perforce computing can offer the game!"},"Projects/50-more-Terabytes":{"slug":"Projects/50-more-Terabytes","filePath":"Projects/50 more Terabytes.md","title":"50 more Terabytes","links":[],"tags":[],"content":"8/23/2024\nOver the Summer I managed to buy 10 more hard drives (WD Red Plus’s). Each one was 10TB and was going to be installed into my NAS. This was a much needed upgrade as I was completely out of storage\n\nPart 1: The RAID\nIn the middle pod I added 5 more hard drives, each one was 10 Terabytes for a total raw addition of 50 terabytes. However, due to redundancy this is not how much space I was able to get back. In that pod of 5 I configured the system to allow for 1 drive to fail and still retail all the data that is stored across the 5 drives. So the total usable space is 40 Terabytes of usable space. This is all possible due to a cool technology called a RAID (Redundant Array of Independent Disks.) and an operating system called TrueNAS.\n\nFigure 1: The New five hard drives installed in the middle pod of the NAS Chassis\n\nPart 2: Airflow\nThe fun was not over that easily! After finishing everything that needed to be done I cleaned up the server and put it back on the rack and all was well. Until about 30 minuets later when I realized that the new RAID performance was extremely worse than what was expected. After digging around I saw that the new drives that were installed were running at 65 degrees (149F). For reference the recommended temperature of a hard drive is 5 to 50 degrees. After googling that fact I realized that I forgot to install the fan in the front of the new hard drives. There was no fan that was blowing fresh air over the drives to cool them. Which is why they were 15 degrees over temperature. After I installed the fan the temps were able to drop all the way down to 45 degrees (113F)\n\nFigure 2: Hard Drive temps before and after the cooling fan\nSo morale of the story to always install fans in a server."},"Projects/Counter-messaging-Campaign":{"slug":"Projects/Counter-messaging-Campaign","filePath":"Projects/Counter-messaging Campaign.md","title":"Counter-messaging Campaign","links":[],"tags":[],"content":"Apr 13, 2025\nFor this assignment I created a lecture that discusses misinformation through the lenses of the moon landing. I discussed things like how misinformation spreads and what we can do to stop it.\n\n\nSlide 1:\nHello and welcome to my lecture my name is Jacob Bauer, and I will be discussing the idea of whether we really did land on the moon. as well as the myths and misinformation that surround these event.\n\n\nSlide 2:\nFor starters lets get go over some of the basic time and dates so we are all on the same page. (Pause). On September 12th 1962 John F Kennedy gave a speech at Rice University. In this speech he said “We choose to go to the moon. We choose to go to the moon in this decade and do the other things, not because they are easy, but because they are hard, because that goal will serve to organize and measure the best of our energies and skills, because that challenge is one that we are willing to accept, one we are unwilling to postpone, and one which we intend to win, and the others, too” This quote echoed across the country and kicked off Americas full scale efforts to get a man on the moon. About seven years later on July 16th 1969 Apollo 11 Launches from Pad 39A at the Kennedy Space Center in Florida and begins its journey to the moon. 4 days later, on July 20th at 10:56 p.m Eastern time Neil Armstrong took his last step off the ladder and became the first man to set foot on the moon. During this historic event over (EMPHASISE) 650 MILLION (EMPHASISE) people watched it live on TV.\n\n\nSlide 3:\nDespite this monumental achievement that caused the whole county to celebrate. (pause) Doubts began to form in the years after the country watched what many described later as the most exciting thing in their entire lives.\n(Pause) It all began with the publication of the book “we never went to the moon” by Bill Kaysing. Bill was a former US Navy officer who worked as a technical writer for one of the rocket manufacturers that NASA hired for the Apollo moon missions. In his book he made claims that he had inside knowledge of a government conspiracy to fake the moon landing. many conspiracy theories about the Apollo moon landings which persist to this day can be traced back to his book.\n(emphasis) Despite not having any scientific background Kaysings book offered commentary on the merits of NASAs ability to build a rocket powerful enough to send men to the moon as well as the validity of the photos and video taken on the mission.\n\n\nSlide 4:\nAfter Kaysing began to spread the ideas that the moon lading was not what it seemed many of the most common moon landing conspiracies began to take the form that we know them today. Some of the most famous ones are\nAccording to the royal museum in Greenwich\n(quote) “The Apollo 11 US flag is waving in the wind… but there’s no wind on the Moon.\n(quote) Why are there no stars in pictures of the NASA Moon landings?\n(quote) Shadows in the Moon landing photos prove the images were faked\n(quote) Apollo astronauts could not have survived Earth’s radiation field\nAll of these conspiracies have scientific explanations provided by professor Ojha that I have added to the table. These explanations are backed up by other experiments. And most famously Myth Busters did an excrement that showcased why the flag on the moon was waving in space.\n\n\nSlide 5:\nAccording to an article written by the university of Manchester. (Pause) The reason that Kaysings ideas were able to take hold in the America publics mid was due to several factors that are often overlooked by other discussions.\nThe context in which these ideas took hold are interesting. At the time in the 1970s the country was in the middle of several disasters that undermined the trust of the American public in the government. From the release of the pentagon papers which showed that the Johnson administration had been systematically lying about the Vietnam War to the public. (PAUSE). A series of congressional reports also detailed CIA malfeasance both at home and abroad and suggested that there was a high probability that there had been a conspiracy to kill president Kennedy. (PAUSE) Finally was the Watergate scandal that left the county shocked and with a new president.\n(New idea) These revelations helped fuel a wider shift in conspiracy thinking, from a belief in external enemies, such as Communists, to the suspicion that the American state was itself conspiring against its citizens.\nTo many the moon lading conspiracies offered by Kaysing arrived at the perfect time to offer a simple answer of government lies to the complex situation of American achievement and political turmoil that was at the front of all American minds.\n\n\nSlide 6:\nIn the modern age the spread and creation of misinformation or “fake news” has become much more prevalent. It can spread across social media and the engagement algorithms that are designed to keep us on the sties for as long as possible feed us more of the same things that we like and less of the stuff that we don’t. this creates echo chambers where all we are exposed to is the stuff that we like. This is a problem because repetition of ideas further cements them into our beliefs.\nThe ideas that spread the fastest and the furthest are the ones that are based on emotions. Like fear, suspicion and (emphasis) ANGER. Outrage content exists for this reason.\nYou can avoid falling into these traps by bettering your media literacy to better spot these tricks and avoid falling onto their traps.\n\n\nSlide 7:\nIn the book Debunk with empathy written by Mike Caulfield he discusses how Mockery only strengthens someone’s beliefs. This entrenchment only makes it harder to change someone’s mind and help them. Especially if they are pursuing dangerous conspiracies. Its not the end of the world if someone does not beloved that the moon landing was real. But it can be the end of the world when someone is avoiding life saving treatment because they believe that modern medicine is not effective at saving lives.\nThe best way to change someone’s mind is to ask them questions and use credible sources when debating them. Going even further you can encourage them to ask their own questions and do their own research.\n\n\nSlide 8:\nWhat can we learn from looking at the conspiracies surrounding the Moon lading. we have learned that they arise from a period of extreme uncertainty. Much like the conspiracies that we saw arise in 2020 during the pandemic.\nIf you take away anything from this presentation, I hope that It is the ability to look at the things people are saying critically. Consider their motivations. If you are outraged ask yourself if this is the goal… (pause)\nLook into the sources of what people are claiming. If they can’t back it up with something concrete, then be skeptical.\nAdding these tools to your toolbox will allow you better interpret the media that you consume on a daily basis. By being skeptical and asking questions you can become someone that thinks for themselves and doesn’t fall victim to manipulation campaigns.\n\n\nSlide 9:\nTo wrap it all up. Its clear that misinformation distorts reality. We have seen that the facts and science are on the side of the moon landing. The claims made against it are made by people looking to exploit the social situation for their own benefit. Be curious. Ask questions and (EMPHASIS) most of all…. be willing to change when you are confronted with facts that go against your current beliefs.\n\n\nSlide 10:\nNow in the spirit of being skeptical and asking questions. Id like to open it up to the audience to ask me any questions you may have about the moon landing or misinformation as a whole…\nPossible questions the audience could ask\n•Why do some conspiracies spread more than others?\n•Have you changed your mind on a belief before?\n•How do you fact-check online info in an effective manner?\n\n"},"Projects/Min-Podcast":{"slug":"Projects/Min-Podcast","filePath":"Projects/Min Podcast.md","title":"Min Podcast","links":[],"tags":[],"content":"Mar 9, 2025\nThis assignment was a 5 minuet podcast that discusses, explains and counters a specific conspiracy. In my case I chose to discuss the Moon landing and the conspiracies that surround that event.\n\nMini Podcast Script:\nFor many people when we hear someone suggest that the moon lading was fake. We automatically assume that that person is a little bit crazy. “How could you not believe?” we exclaim to them. Then typically they will respond with a few of their favorite pieces of evidence that they believe proves their point of view “how can you believe” they will often say in return. What happens next is the most important part of these interactions. We can either choose to further engage with the sceptics or we can choose to simply call them crazy and move on. Many of us often choose to do the 2nd option, and why not? It’s easier. But the main reason that many of us choose to walk away is that we don’t have any facts to back ourselves up. In that situation they are the expert, and we have no idea what we are talking about. The point of this podcast is to help prepare you for these possibilities and ensure that when you enter one of these situations you are the expert not the other way around.\nFor starters one of the most common moon landing conspiracies asked is “Why did the US flag on the Moon flutter as though there was wind. there is no air on the moon so how can the flag be flying on the flagpole?” The flag that we saw on Apollo 11 was purchased from a local store in Houston for $5.50 and was hemmed to the top so that it hung from a horizontal crossbar fixed on top of the pole. Furthermore, because there is no air on the moon, any movement in the flag from it being twisted into the surface will continue because of the lack of air resistance\nAnother claim by moon landing deniers is that there are no stars in the background of the photos taken on the moon. Well, this can be explained with the use of photography and film knowledge. A photographer must consider the lens aperture and shutter speed, both of which control how much light hits the film. A smaller aperture means less light, as does a faster shutter speed. It’s almost like how your pupil constricts on a bright day and dilates at night: Your eye automatically adjusts your appearance so that you can see in different conditions. According to Astronomy . com “Because the most important things the astronauts photographed were each other and the Moon’s surface, their cameras were set to capture them in focus — not the dimmer, distant stars.” There are even long exposure photos that NAS released that captured some stars from the surface of the moon. But these photos are not talked about due to their degraded quality\nFinally, there is the claim of “why haven’t we been back to the moon?” this one is less of a scientific question and more of a political one. According to the Royal Museum of Greenwich in the UK they state that “Whilst the US government was willing to put a lot of money into the Apollo missions when it was helpful to the space race, research and technological development were not viewed as a priority. Apollo 11 was a political statement during the space race, and once it had been made, the necessity for more missions to the Moon was gone.” This quote shows that the moon landing was always a political mission. After the mission was a success Congress saw little value in the continued funding of NASA and its scientific experiments. This is why the last 3 missions of the Apollo program were scraped.\nAfter listening to these rebuttals, I hope that you have learned a lot of new information. If you ever find yourself in a situation where you need to debate with someone that denies the moon landing you can use this newfound knowledge to your advantage. Using the information that we talked about today you will be able to at least make the deniers think about their position. There is little you can do to make them change their mind in that moment. But planting seeds of doubt into their conspiracies is the best that we can hope for. If you hope to change the denies whole world view in that Monet, then you will be disappointed. But if you can put up a good fight in the debate, they will be the ones that are disappointed."},"Projects/Photojournalism-Article":{"slug":"Projects/Photojournalism-Article","filePath":"Projects/Photojournalism Article.md","title":"Photojournalism Article","links":[],"tags":[],"content":"Feb 23, 2025\nFor this assignment I wrote an article that discusses the future of Purdue through the view of the construction that is affecting campus.\n\nPurdue’s 1.3 Billion Dollar Gamble\n"},"Projects/Stakeholders-Sheet":{"slug":"Projects/Stakeholders-Sheet","filePath":"Projects/Stakeholders Sheet.md","title":"Stakeholders Sheet","links":[],"tags":[],"content":"Feb 2, 2025\nFor this assignment we needed to create a sheet that analyzes the basics for our Photojournalism Article. Such as the target audience, Purpose, exigence, and genre.\n\nRhetorical situation\nWho is the author of your photojournalism article? Are you taking on a persona or assuming a future version of yourself? What are they like? How are they qualified?\nThe Author of my Article will be myself. I am Personally interested in my topic so I will just try to be myself and convey my inters to the reader. I am qualified to talk about the changes at Purdue since I am a second semester senior. I have personally seen campus change over the last four years and feel qualified to talk about my experiences.\n\nWhat is the subject of your photojournalism article? Are there any secondary themes? Who or what is this subject like?\nThe Main subject of my article is the construction across campus. One of the secondary themes that I could talk about is why there is so much construction. As well as go into details about what each project is doing.\n\nWhat is the genre of your project? What media and modes does it combine? How would you define this genre? How might it be circulated/published?\nThe genre of my project will be an article that has pictures of some of the large and small construction sites across campus. There will then be a paragraph or two describing what is happening and why. I would define this genre as journalism since it is trying to disseminate information that is relevant to the people at and around Purdue. This article could be published electronically on a website to allow for people to see the full resolution images.\n\nWhat is your purpose as an author? You might have several of these related to the class, the scenario of the assignment, and the topic. How are they similar or different? Do any of your purpose(s) contradict?\nThe Purpose that that I am pursuing for this assignment is to inform the audience of the changes that are happening around campus as well as possible driving forces that are casing these changes. I hope to help the audience, whether that be the class or the broader student body become more aware of what is happening across campus.\n\nWhat is the exigence of your article? Again, you might have multiple levels of these. What is the kairos (timeliness) of your article? Why is now the best time for you to be completing an article on this topic?\nThe reason that I am choosing to write about the construction around campus is because there is such a large presence of construction everywhere. There is even construction across the street from where I live. The construction continues to annoy me daily. I feel that the timeliness of this article is good because of the many different big projects that are impacting the day to day on campus.\n\nStakeholders &amp; Audience\nWho is the literal audience of your photojournalism essay? Who is your target or intended audience? Who is your implied or addressed audience, if any?\nThe literal audience will be the other students in class with us that I can directly share my article with. My intended audience will be the entirety of the Purdue Student body. This will also be my addressed audience as I will try to make the article describe a broad picture that can resonate with any student.\n\nWhat is your target audience’s relationship to your topic before reading the article? What would you like it to be after reading it? What would you like them to do or believe after reading?\nMost students on campus are aware of the construction. Its very hard to not see or hear. But I feel that many students see it as the reason that the sidewalk is closed and don’t think deeper than that. I hope that after reading students will have a deeper understanding of why Purdue is building and upgrading so much at once.\n\nLet’s imagine you were publishing this in The Exponent. Who would have a financial or similar interest in your article being accurate, popular, and persuasive? Why?\nIf this article were published in the Exponent the financial interests that surround my topic are the landlords of different housing projects as well as the university itself. Admissions are heavily influenced by financial desires. The exponent would want the article to be as accurate and popular as possible. While if the information is not positive then the people being covered in the article will want the article to not be popular.\n\nWho might the “internal” stakeholders be for article? Who might the “external” stakeholders be? Again, imagine publishing in The Exponent if that helps make your list more concrete.\nThe internal stakeholders of the article would be those that published the article. Such as the writers editors and photographers. The external stakeholders are the ones that do not have a direct interest in the articles success. Such as regular students who just read the article."},"Projects/Statecraft":{"slug":"Projects/Statecraft","filePath":"Projects/Statecraft.md","title":"Statecraft","links":[],"tags":[],"content":"4/22/2025\nStatecraft is the project that me and my friends have been working on for the past year.\n\nPart 1: The Concept\nStatecraft is a Minecraft project that is attempting to recreate MCHeli.A mod that adds a lot of war like vehicles to the game like tanks, and fighter jets in modern Minecraft (1.19.2) . The project will also add aspects of politics like borders, trading, spying, and all sorts of other diplomatic activities that teams can engage in with other teams.\n\nPart 1: The World\nThe plan for statecraft is a simple one at first glance. But gets oh so much harder upon implementation. The plan for the the server that\n"},"Projects/The-Worlds-Most-Powerful-Minecraft-Computer":{"slug":"Projects/The-Worlds-Most-Powerful-Minecraft-Computer","filePath":"Projects/The Worlds Most Powerful Minecraft Computer.md","title":"The Worlds Most Powerful Minecraft Computer","links":[],"tags":[],"content":"4/26/2025"},"Projects/What-we-can-learn-from-conspiracy-theories":{"slug":"Projects/What-we-can-learn-from-conspiracy-theories","filePath":"Projects/What we can learn from conspiracy theories.md","title":"What we can learn from conspiracy theories","links":[],"tags":[],"content":"Mar 30, 2025\nThis reading response was in response to two of the articles that the class read in preparation for the Counter messaging campaign.\n\nReading Response 2\nFor the first article that I’d like to respond to be the “What we can learn from conspiracy theories” article that we read for the Mini Podcast assignment. In this article it gave the example of the Mass poisoning from the year 331 BC. At the time they believed that a group of women were responsible for the mass poisoning. But we now know that the cause of the deaths was just a disease outbreak. The effects of the disease outbreak were blamed on the women who were most likely creating medicine to help with the effects of the sickness. This blame is explained due to the need that was described in the article that “people turn to conspiracy theories more when they’re confronted with crisis situations.” This need for people to blame something when there is a crisis can also explain why we saw the increase in conspiracy theories in 2020 during the pandemic. People want to know what is going on and when the authorities cannot offer an explanation at all or one that seems too far-fetched, people begin to fill in the dots by themselves. These knowledge gaps can be exploited by people who claim to be able to offer the answers. I have seen first-hand, people that I know change their beliefs because of someone they trust either in person or even online telling them something that they believe. This trust relates well to the next article that I would like to discuss. The article named “How to Resist the Temptation of AI When Writing” is the opposite of conspiracy theories. It discusses how to do good research without using AI to write it or generate sources. In this article I liked how it discussed the major advantages of not using AI. It feels like today everyone is using it for some reason or another. But I try not to use it for simple things that I know I can do by myself. In the article it states that “locating credible databases and sources and accurately vetting information can be the difference between turning a story around quickly or getting stuck with outdated information.” What this quote is saying is that it’s important to have up to date information for the things that you are going to argue and talk about. The article talks about great ways to find sources like at the library which have sources for things like Journals data sets and even access to paid resources like embargoed research. A quote about internet sources also struck me “keep in mind that the internet is full of false information, and websites that look trustworthy can sometimes turn out to be businesses or companies with a vested interest in you taking their word as objective fact without additional scrutiny.”  This relates perfectly to the first article because it talks about vested interests. Many vested interests will put out fake information that supports their point of view. So, it is important to always stay vigilant for false information no matter what form it takes. Overall, I think that these articles were informative to read and better prepared me to write and research the facts."},"Resume":{"slug":"Resume","filePath":"Resume.md","title":"Resume","links":[],"tags":[],"content":"\n\n\n                  \n                  Info\n                  \n                \n\n\nResume last updated 3/15/25\n\n\n"},"index":{"slug":"index","filePath":"index.md","title":"index","links":["Blog","Resume"],"tags":[],"content":"Welcome\nHello, my name is Jacob and I am a Senior @ Purdue University studying cybersecurity and love all things technology. I love learning something new everyday. In my spare time, I work on applying the concepts I have learned in class to my homelab.\n\n\nCurrent Projects\nI am always working on something!!\nFind out more: Blog\n\nResume\nResume\n\nContact Me\nResume: Resume\nLinkedIn: LinkedIn\nEmail: Jacob@Hexadual.io\nGitHub: Hexadual"}}